# Task1: How to sort dataframe by index and how to sort dataframe by specific column?

In [21]:
import pandas as pd

df1 = pd.DataFrame({
    "city": ["new york", "chicago", "orlando"],
    "temperature": [21, 14, 35],
}, index=[2, 0, 1])

df2 = pd.DataFrame({
    "city": ["chicago", "new york", "orlando", "California"],
    "humidity": [65, 68, 75, 56],
}, index=[2, 1, 3, 0])

df1_sorted_by_index = df1.sort_index()

df2_sorted_by_index = df2.sort_index()

In [22]:
df3 = pd.merge(df1_sorted_by_index, df2_sorted_by_index, on="city", how="outer")

df3_sorted_by_index = df3.sort_index()

df3_sorted_by_temperature = df3.sort_values(by="temperature", ascending=True)

In [23]:
print("df1\n",df1)
print()
print("df1_sorted_by_index\n",df1_sorted_by_index)
print()
print("df2\n",df2)
print()
print("df2_sorted_by_index\n",df2_sorted_by_index)
print()
print("df3\n",df3)
print()
print("df3_sorted_by_index\n",df3_sorted_by_index)
print()
print("df3_sorted_by_temperature\n",df3_sorted_by_temperature)

df1
        city  temperature
2  new york           21
0   chicago           14
1   orlando           35

df1_sorted_by_index
        city  temperature
0   chicago           14
1   orlando           35
2  new york           21

df2
          city  humidity
2     chicago        65
1    new york        68
3     orlando        75
0  California        56

df2_sorted_by_index
          city  humidity
0  California        56
1    new york        68
2     chicago        65
3     orlando        75

df3
          city  temperature  humidity
0     chicago         14.0        65
1     orlando         35.0        75
2    new york         21.0        68
3  California          NaN        56

df3_sorted_by_index
          city  temperature  humidity
0     chicago         14.0        65
1     orlando         35.0        75
2    new york         21.0        68
3  California          NaN        56

df3_sorted_by_temperature
          city  temperature  humidity
0     chicago         14.0        65
2    new york         21.0        68
1     orlando         35.0        75
3  California          NaN        56

# Task2: What is lambda expression?

***Unnamed function ,you can call it inline without defining it becouse its one single expression not block of code ,and ues it for simple function.***

In [24]:
#def function
def hello_1(name):
    return f"Hello {name} in jordan"

print(hello_1("esraa"))

#lambda expression
hello_2 = lambda name : f"Hello {name} in jordan"

print(hello_2("noor"))

Hello esraa in jordan
Hello noor in jordan

# Task3: How to detect and remove outliers using pandas?

In [25]:
import numpy as np 
data = pd.DataFrame({
    'Name':['noor', 'esraa', 'hamza', 'abdallah', 'smaher'],
    'Age':[-12, 2100, 18, -40, 25],
    'Address':['amman', 'hebron', 'alquds', 'hebron', 'salt'], 
})
data

       Name   Age Address
0      noor   -12   amman
1     esraa  2100  hebron
2     hamza    18  alquds
3  abdallah   -40  hebron
4    smaher    25    salt

In [26]:
def remove_outlier():
    filtered_data = data[(data['Age'] > 0) & (data['Age'] <= 100)]
    return filtered_data

remove_outlier()

     Name  Age Address
2   hamza   18  alquds
4  smaher   25    salt

# Task4: How to read random rows from our data?

In [27]:
df = pd.DataFrame({
    'Name':['noor', 'esraa', 'hamza', 'abdallah', 'smaher'],
    'Age':[12, 21, 18, 40, 25],
    'Address':['amman', 'hebron', 'alquds', 'hebron', 'salt'], 
})
df

       Name  Age Address
0      noor   12   amman
1     esraa   21  hebron
2     hamza   18  alquds
3  abdallah   40  hebron
4    smaher   25    salt

In [28]:
#1 use sample()
df.sample()

   Name  Age Address
0  noor   12   amman

In [29]:
#2
df.sample(3)

       Name  Age Address
2     hamza   18  alquds
3  abdallah   40  hebron
0      noor   12   amman

In [30]:
#3 fraction of rows
df.sample(frac =0.6)

       Name  Age Address
3  abdallah   40  hebron
2     hamza   18  alquds
0      noor   12   amman

# Task5: How to combine more than two dataframes at the same time?

In [31]:
df1 = pd.DataFrame({
    'Name':['noor', 'esraa', 'hamza'],
    'Age':[12, 21, 18],
})
df2 = pd.DataFrame({
    'Name':['esraa', 'hamza', 'abdallah', 'smaher'],
    'Address':['hebron', 'alquds', 'hebron', 'salt'], 
})
df3 = pd.DataFrame({
    'Name':['noor', 'hamza', 'abdallah', 'smaher', 'abdalrhman'],
    'gender':['femail', 'mail', 'mail', 'femail', 'mail'], 
})

In [32]:
data = pd.merge(pd.merge(df1, df2, on="Name", how="outer"), df3, on="Name", how="outer")
data

         Name   Age Address  gender
0        noor  12.0     NaN  femail
1       esraa  21.0  hebron     NaN
2       hamza  18.0  alquds    mail
3    abdallah   NaN  hebron    mail
4      smaher   NaN    salt  femail
5  abdalrhman   NaN     NaN    mail

# Task6: Replace data in specific columns with specific value.

In [33]:
df = pd.DataFrame({
    'Name':['noor', 'esraa', 'hamza', 'abdallah', 'smaher'],
    'Age':[12, 21, 18, 40, 25],
    'Address':['amman', 'hebron', 'alquds', 'hebron', 'salt'], 
})

In [34]:
change_age = df.replace([12, 21, 18, 40, 25],["children", "adult", "adult", "old", "adult"])
change_age

       Name       Age Address
0      noor  children   amman
1     esraa     adult  hebron
2     hamza     adult  alquds
3  abdallah       old  hebron
4    smaher     adult    salt

# Task7: Write dataframes to two separate sheets in excel.

In [35]:
df_first = pd.DataFrame({
    "city": ["new york", "chicago", "orlando"],
    "temperature": [21, 14, 35],
}, index=[2, 0, 1])

In [36]:
df_second = pd.DataFrame({
    'Name':['noor', 'esraa', 'hamza', 'abdallah', 'smaher'],
    'Age':[12, 21, 18, 40, 25],
    'Address':['amman', 'hebron', 'alquds', 'hebron', 'salt'], 
})

In [37]:
with pd.ExcelWriter('first_second.xlsx') as writer:
    df_first.to_excel(writer, sheet_name="first")
    df_second.to_excel(writer, sheet_name="second")